# -*- coding:utf-8 -*-

"""
执行 run 之前需要在 config.py 配置 url、分类关键词
"""

# 分类网址
FEEDBACK_URL = ""

# webdrvier 存放位置
CHROME_PATH = r""

# query list
QUERY_LIST = [
    ["担心泄露隐私", "隐私", "私隐", "不想别人看", "隱私", "稳私", "泄露", "瘾私"],
    ["想关闭看一看", "关闭", "关掉", "不想要这个功能"],
    ["色情低俗", "色情", "低俗"],
    ["标题党", "标题党", "文不对题", "张冠李戴", "标题与内容不符", "雷人标题", "广告"],
    ["传销诈骗", "传销", "古币", "钱币", "诈骗"],
    ["宗教反馈", "穆斯林", "基督"],
    ["推股荐股", "推荐股票"],
    ["视频打不开", "视频打不开", "不能播放", "视频异常", "无法播放"],
    ["视频卡顿", "视频无响应", "视频卡"],
    ["找不到入口", "没有看一看", "看一看找不到", "没有入口", "找不到看一看", "没有找到入口", "看一看没有", "没有“看一看”", "没有‘看一看’", "没有\"看一看\""
        , "没有\'看一看\'"],
    ["欧盟用户找不到入口", "发现页管理", "发现管理页"],
    ["看一看白屏", "看一看白屏", "白屏", "什么都不显示", "刷新后无内容", "不显示内容"],
    ["看一看打不开", "看一看打不开"],
    ["新增功能反馈", "红点", "全选", "浏览历史", "瀏覽歷史", "一键屏蔽", "建议", "希望"],
    ["看一看闪退", "闪退", "重启"],
    ["看一看黑屏", "黑屏"],
    ["图片加载不出", "图片打不开", "图片加载不了"],
    ["内容质量差", "质量", "垃圾", "文理不通", "乱七八糟"],
    ["红点消不了", "红点消不了"],
    ["字体反馈", "文字", "字体"],
    ["认为看一看占内存", "占内存", "占空间"],
    ["文章打不开", "文章打不开"],
    ["虚假信息", "虚假", "骗人"],
    ["视频黑屏", "视频黑屏"]
]